Markdown 标签
============


标题
---

而在 Markdown 中，你只需要在文本前面加上 # 
Setext形式是用底線的形式，利用=（最高階標題）和-（第二階標題）


列表
---
无序列表用 * 或 + 或 - 开头表示 
有序列表用数字跟一个英文句点表示  


链接和图片
---
在 Markdown 中，插入链接不需要其他按钮，你只需要使用 [显示文本](链接地址) 这样的语法即可

\![](http://ww4.sinaimg.cn/bmiddle/aa397b7fjw1dzplsgpdw5j.jpg)
注：插入图片的语法和链接的语法很像，只是前面多了一个 ！。

引用
---
在我们写作的时候经常需要引用他人的文字，这个时候引用这个格式就很有必要了，在 Markdown 中，你只需要在你希望引用的文字前面加上 > 

粗体和斜体
---
Markdown 的粗体和斜体也非常简单，用两个 * 包含一段文本就是粗体的语法，用一个 * 包含一段文本就是斜体的语法。

强调
---
包括斜体与粗体，分别对应HTML中的 em 与 strong 标签。斜体为两边各一个 # 或 _ 包裹，而粗体用 ## 或 __ 包裹，斜体可与粗体嵌套，比如： ##_斜粗体_## 。


表格
---
相关代码：

| Tables        | Are           | Cool  |
| ------------- |:-------------:| -----:|
| col 3 is      | right-aligned | $1600 |
| col 2 is      | centered      |   $12 |
| zebra stripes | are neat      |    $1 |


相关代码：
dog | bird | cat
----|------|----
foo | foo  | foo
bar | bar  | bar
baz | baz  | baz


显示链接中带括号的图片
---

代码如下:

\![][1]
\[1]: http://latex.codecogs.com/gif.latex?\prod%20\(n_{i}\)+1  

换行
---
目前需要才结尾加两个空格后回车才能启用新行，两个空格在编辑器中根本是无法肉眼直接观察出来的，希望有回车符号后直接换行。



Markdown允许通过反斜杠 \ 来转义下面的特殊字符：  
---
 \   反斜杠  
 \`   反引号  
 \*   星号  
 \_   下划线  
 \{}  花括号  
 \[]  方括号  
 \()  括号  
 \#   井号  
 \+   加号  
 \-   减号  
 \.   英文句点  
 \!   感叹号  

 分隔線
 ----

你可以在一行中用三個或以上的星號、減號、底線來建立一個分隔線